app/views/books/show.html.erb

SELECT  `authors`.* FROM `authors` WHERE `authors`.`id` = 1 LIMIT 1
---
			<li><strong>Category: </strong><%= @book.category.name %></li>
			<li><strong>Author: </strong><%= @book.author.first_name %> <%=@book.author.last_name %></li>