app/controllers/authors_controller.rb

  def create
    @author = Author.new(author_params)
    if @author.save
---
INSERT INTO `authors` (`first_name`, `last_name`, `created_at`, `updated_at`) VALUES ('Tsutomu', 'Satō', '2016-06-02 14:09:06', '2016-06-02 14:09:06')