app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
     if@book.save
---
INSERT INTO `books` (`title`, `category_id`, `author_id`, `publisher_id`, `price`, `excerpt`, `volumes`, `year`, `created_at`, `updated_at`) VALUES ('Hyouka', 2, 1, 24, '100$', 'Energy-conservative high school student Houtarou Oreki ends up with more than he bargained for when he signs up for the Classics Club at his sister\'s behest—especially when he realizes how deep-rooted the club\'s history really is. Begrudgingly, Oreki is dragged into an investigation concerning the 45-year-old mystery that surrounds the club room.\r\nAccompanied by his fellow club members, the knowledgeable Satoshi Fukube, the stern but benign Mayaka Ibara, and the ever-curious Eru Chitanda, Oreki must combat deadlines and lack of information with resourcefulness and hidden talent, in order to not only find the truth buried beneath the dust of works created years before them, but of other small side cases as well.\r\nBased on the award-winning Koten-bu light novel series, and directed by Yasuhiro Takemoto of Suzumiya Haruhi no Shoushitsu, Hyouka shows that normal life can be full of small mysteries, be it family history, a student film, or even the withered flowers that make up a ghost story.', 9, '2009', '2016-06-05 14:33:37', '2016-06-05 14:33:37')

  def index
    @books = Book.all
---
SELECT `books`.* FROM `books`

  def show
    @book = Book.find(params[:id])
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 2 LIMIT 1