app/controllers/categories_controller.rb

INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('Seinen', '2016-06-02 13:42:15', '2016-06-02 13:42:15')
---
  def create
    @category = Category.new(category_params)
    if@category.save