app/controllers/publishers_controller.rb

INSERT INTO `publishers` (`name`, `created_at`, `updated_at`) VALUES ('Movic', '2016-06-02 14:05:46', '2016-06-02 14:05:46')
---
  def create
    @publisher = Publisher.new(publisher_params)
    if @publisher.save